tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "shivakar/tap"
brew "arping"
brew "readline"
brew "xz"
brew "asciinema"
brew "aspell"
brew "autossh"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "colordiff"
brew "ffmpeg"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grep"
brew "gzip"
brew "helm"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "ipcalc"
brew "jq"
brew "krew"
brew "kubectx"
brew "less"
brew "lua"
brew "lzop"
brew "make"
brew "mysql"
brew "nmap"
brew "node"
brew "p7zip"
brew "perl"
brew "png2ico"
brew "postgresql"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pylint"
brew "reattach-to-user-namespace"
brew "restic"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "uncrustify"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "yamllint"
brew "youtube-dl"
brew "yq"
brew "zlib"
brew "shivakar/tap/pdfjam"
cask "authy"
cask "basictex"
cask "dropbox"
cask "firefox"
cask "font-fira-code"
cask "freecad"
cask "github-beta"
cask "google-chrome"
cask "insomnia"
cask "mendeley"
cask "openscad"
cask "plex-media-player"
cask "seafile-client"
cask "slack"
cask "spectacle"
cask "transmission"
cask "typora"
cask "visual-studio-code-insiders"
cask "vlc"
cask "zoom"
