authy
balenaetcher
cgoban
docker-edge
dosbox-app
drawio
dropbox
elmedia-player
firefox
font-fira-code
github-beta
handbrake
jasper
java
kindle
kitematic
mactex
mendeley
phantomjs
plex-media-player
postman
pritunl
private-internet-access
seafile-client
signal
skype
slack
spectacle
steam
transmission
typora
visual-studio-code
vlc
whatsapp
wireshark
zoomus
