cakebrew
cgoban
docker-edge
dosbox
dropbox
elmedia-player
etcher
firefox
font-fira-code
github-beta
handbrake
haskell-for-mac
jasper
java
kafka-tool
kitematic
mactex
mendeley
phantomjs
plex-media-player
postman
pritunl
private-internet-access
seafile-client
sigil
signal
skype
slack
spectacle
steam
stellarium
teamsql
textual
transmission
typora
visual-studio-code
vlc
whatsapp
wireshark
zoomus
