awscli
azure-cli
bash
bash-completion
cloc
cmake
colordiff
coreutils
cppcheck
ctags
dos2unix
elinks
ffmpeg
gcc
gdb
geoip
gifsicle
git
gnupg
go
graphviz
htop
imagemagick
jq
kubernetes-cli
lcov
less
lua
make
moreutils
multitail
nmap
npm
opencv
p7zip
pandoc
pv
pwgen
pyenv
pyenv-virtualenvwrapper
qrencode
reattach-to-user-namespace
sqlite
tmux
trash
tree
uncrustify
unrar
vim --with-lua --with-python@2 --with-tcl --with-gettext
watch
wget
youtube-dl
zlib
