tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "arping"
brew "asciinema"
brew "python@3.9"
brew "awscli"
brew "colordiff"
brew "exa"
brew "ffmpeg"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grep"
brew "gzip"
brew "htop"
brew "imagemagick"
brew "ipcalc"
brew "jq"
brew "less"
brew "make"
brew "nmap"
brew "p7zip"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "reattach-to-user-namespace"
brew "restic"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unzip"
brew "vim"
brew "wget"
brew "youtube-dl"
brew "yq"
brew "zlib"
cask "authy"
cask "basictex"
cask "firefox"
cask "font-fira-code"
cask "google-chrome"
cask "spectacle"
cask "visual-studio-code-insiders"
cask "vlc"
