tap "derailed/k9s"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "arping"
brew "asciinema"
brew "aspell"
brew "aws-iam-authenticator"
brew "awscli"
brew "python@3.8"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "cmake"
brew "gcc"
brew "clang-format"
brew "cloc"
brew "colordiff"
brew "coreutils"
brew "cppcheck"
brew "ctags"
brew "dos2unix"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gdb"
brew "gh"
brew "gifsicle"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "go@1.10"
brew "go@1.9"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gzip"
brew "helm"
brew "hey"
brew "htop"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "ipcalc"
brew "jq"
brew "openjdk"
brew "kafka"
brew "krb5"
brew "kubernetes-cli"
brew "kubectx"
brew "lcov"
brew "less"
brew "lua"
brew "lzop"
brew "make"
brew "minikube", link: false
brew "mitmproxy"
brew "moreutils"
brew "multitail"
brew "mysql"
brew "nmap"
brew "node"
brew "numpy"
brew "opencv"
brew "p7zip"
brew "pandoc"
brew "pdfjam"
brew "postgresql"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qrencode"
brew "reattach-to-user-namespace"
brew "redis"
brew "restic"
brew "ruby"
brew "rust"
brew "rustc-completion"
brew "subnetcalc"
brew "the_silver_searcher"
brew "tmux"
brew "trash"
brew "tree"
brew "uncrustify"
brew "unzip"
brew "vim"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "derailed/k9s/k9s"
cask "authy"
cask "basictex"
cask "boostnote"
cask "docker-edge"
cask "dosbox"
cask "dropbox"
cask "elmedia-player"
cask "firefox"
cask "font-fira-code"
cask "github-beta"
cask "keystore-explorer"
cask "kitematic"
cask "mendeley"
cask "phantomjs"
cask "plex-media-player"
cask "pritunl"
cask "private-internet-access"
cask "seafile-client"
cask "sigil"
cask "slack"
cask "spectacle"
cask "texmaker"
cask "toggl-track"
cask "transmission"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "wkhtmltopdf"
cask "zoom"
cask "zoomus"
