aws-iam-authenticator
awscli
azure-cli
bash
bash-completion
clang-format
cmake
colordiff
coreutils
cppcheck
ctags
dos2unix
ffmpeg
gcc
gdb
geoip
gifsicle
git
gnupg
go
gzip
hey
htop
hub
hugo
imagemagick
jq
k9s
kafka
kubectx
kubernetes-cli
kubernetes-helm
lcov
less
lua
make
moreutils
multitail
mysql
nmap
node
p7zip
pandoc
pinentry
postgresql
pv
pwgen
pyenv
pyenv-virtualenv
python
qrencode
reattach-to-user-namespace
redis
snappy
sqlite
tmux
trash
tree
uncrustify
unrar
unzip
vim
watch
wget
youtube-dl
zlib
zookeeper
